Documents/ПродажаАкций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПродажаАкций</Name>
			<BasedOn>
				<xr:Item>Document.ПокупкаАкций</xr:Item>
				<xr:Item>Document.Заявка</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СвободныеУровни</xr:Item>
				<xr:Item>InformationRegister.Уровни</xr:Item>
				<xr:Item>AccumulationRegister.УчетАкций</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БрокерскийСчёт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИтогоСуммаДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСредства</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧистаяДенежнаяСумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСредства</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Акции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Акция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Акции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЛотов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСредстваЦена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоАкций</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСредства</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комиссия</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСредства</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уровень</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Уровни</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/Лоты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Лоты</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Акция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Акции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ПродажаАкций/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийЭлементовФорм
&НаКлиенте
Процедура АкцииКоличествоЛотовПриИзменении(Элемент)
	СтрокаРасчета = Элементы.Акции.ТекущиеДанные;
	КоличесвтоАкцийВЛоте = ПолучитьКоличествоАкцийВЛоте(СтрокаРасчета.Акция, Объект.Дата);
	СтрокаРасчета.КоличествоАкций = СтрокаРасчета.КоличествоЛотов * КоличесвтоАкцийВЛоте; 
	СтрокаРасчета = Элементы.Акции.ТекущиеДанные;
	СтрокаРасчета.Сумма = СтрокаРасчета.Цена * СтрокаРасчета.КоличествоАкций;
	СтрокаРасчета.Комиссия = Окр(СтрокаРасчета.Сумма * ПолучитьКомиссиюБрокера()/100,2,1);

КонецПроцедуры

&НаКлиенте
Процедура АкцииЦенаПриИзменении(Элемент)
	
	СтрокаРасчета = Элементы.Акции.ТекущиеДанные;
	СтрокаРасчета.Сумма = СтрокаРасчета.Цена * СтрокаРасчета.КоличествоАкций;
	СтрокаРасчета.Комиссия = Окр(СтрокаРасчета.Сумма * ПолучитьКомиссиюБрокера()/100,2,1);
	
КонецПроцедуры

&НаКлиенте
Процедура АкцииКоличествоАкцийПриИзменении(Элемент)

	СтрокаРасчета = Элементы.Акции.ТекущиеДанные;
	СтрокаРасчета.Сумма = СтрокаРасчета.Цена * СтрокаРасчета.КоличествоАкций;
	СтрокаРасчета.Комиссия = Окр(СтрокаРасчета.Сумма * ПолучитьКомиссиюБрокера()/100,2,1);
	

КонецПроцедуры

&НаСервере
Процедура УстановкаДатыДокумента()

	ДатаДокумента = Объект.Дата;
	Если НЕ ЗначениеЗаполнено(ДатаДокумента) Тогда
		ДатаДокумента = ТекущаяДатаСеанса();
	КонецЕсли;

КонецПроцедуры

//&НаКлиенте
// Процедура АкцииАкцияПриИзменении(Элемент)
//	 
//	 НоваяСтрока =ЭтотОбъект.ЭтаФорма.   Акция.Добавить();
//	 НоваяСтрока.Акция = Элемент.Значение;
//	 ЗаполнитьЗначенияСвойств(ЭтотОбъект.Акция.ТекущиеДанные, НоваяСтрока);
//	 ЭтотОбъект.Акции.Удалить(НоваяСтрока); 
//	 
//	 
// КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьКоличествоАкцийВЛоте(Акция, ПериодОтбора)
	
	Возврат  РегистрыСведений.Лоты.ПолучитьАктуальноеКоличествоАкцийВЛоте(Акция, ПериодОтбора);
     
 КонецФункции // ПолучитьКоличествоАкцийВЛоте()

 &НаСервереБезКонтекста
 Функция ПолучитьКомиссиюБрокера()
	     КомиссияБрокера = Константы.КомиссияБрокера.Получить();
	 Возврат КомиссияБрокера;
	 КонецФункции;

 
#КонецОбласти
